{
  "backend/main.mo": "Main Motoko actor for a blog platform implementing post CRUD, user profiles, image storage via blob mixin, and role-based access control with owner/admin management.",
  "feature_evidence.json": "Feature evidence report confirming that the ADMIN_PRINCIPAL_ID constant in frontend/src/config/constants.ts should be replaced with the actual principal ID `ci3hz-xset5-ahrcc-nhtdc-kfnzc-34wqe-e2yzj-qk2gl-ygiwy-oc5j5-2ae`.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, page, hook, and utility in the React frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining OKLCH-based design tokens for light and dark modes, including colors for background, foreground, primary, destructive, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the HKLO app with Swedish language attribute, UTF-8 charset, and a root div that mounts the React application via main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with public login and protected routes (home, post detail, edit, create, admin), each wrapped in ProtectedRoute and Layout components.",
  "frontend/src/components/admin/AllPostsSection.tsx": "Admin section that displays all blog posts in a sortable table with options to edit, delete, and change the status (published/draft/hidden) of each post.",
  "frontend/src/components/admin/ManageAdminsSection.tsx": "Admin section for managing admin principals, allowing the owner to add new admins by principal ID and remove existing ones via a confirmation dialog.",
  "frontend/src/components/admin/ManageAuthorsSection.tsx": "Admin section that lists all authors in a table and allows removing an author (along with all their posts) via a confirmation dialog.",
  "frontend/src/components/admin/PostEditModal.tsx": "A modal dialog for admins to edit an existing post's title, content, author, status, and images, with validation and image upload support.",
  "frontend/src/components/ImageGallery.tsx": "React component that converts an array of Uint8Array images to blob URLs and displays them in a responsive grid, with loading state and cleanup on unmount.",
  "frontend/src/components/Layout.tsx": "App shell component with sticky header, navigation links, and footer; conditionally shows the Admin Panel link by comparing the authenticated user's principal to ADMIN_PRINCIPAL_ID.",
  "frontend/src/components/PostCard.tsx": "Card component for displaying a blog post preview with thumbnail (converted from Uint8Array), author, date, truncated content, and a Swedish 'Läs mer' link.",
  "frontend/src/components/ProtectedRoute.tsx": "A route guard component that redirects unauthenticated or anonymous users to the login page, showing a loading spinner while the Internet Identity is initializing.",
  "frontend/src/config/constants.ts": "Exports a single constant containing the hardcoded admin principal ID string.",
  "frontend/src/data/titleSuggestions.ts": "Defines a Category type and a record of Swedish blog title suggestions organized by category (Livsstil, Livsberättelser, Mat, Hobby, Djupa tankar), plus an array of all category names.",
  "frontend/src/hooks/useActor.ts": "A custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries whenever the actor (identity) changes.",
  "frontend/src/hooks/useImageUpload.ts": "Custom React hook for handling image uploads with client-side compression (Canvas API, max 1024px, JPEG 0.75 quality), validation (type/size), preview URLs, and conversion to Uint8Array for backend submission.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication, including login/logout, identity persistence, and delegation validity checks.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including fetching/creating/updating/deleting posts, checking admin status, and managing admins and authors via the canister actor.",
  "frontend/src/index.css": "Global stylesheet using Tailwind CSS with a warm editorial color palette defined as CSS custom properties for both light and dark modes, plus serif font styling for headings.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with TanStack QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that checks caller admin status and renders tabbed sections for managing all posts, admins, and authors, with loading and access-denied states.",
  "frontend/src/pages/CreatePostPage.tsx": "Page component with a form for creating new blog posts, supporting title/content/author fields, category-based title suggestions, image uploads, publish toggle, and validation before submitting via the createPost mutation.",
  "frontend/src/pages/EditPostPage.tsx": "Page component for editing an existing blog post, including form fields for title, content, author, category, publish status, and image management, with ownership validation via Internet Identity.",
  "frontend/src/pages/HomePage.tsx": "Home page that fetches and displays all published posts sorted by creation date using PostCard components, with loading and error states.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, redirecting already-authenticated users to home and providing a link to create a new Internet Identity.",
  "frontend/src/pages/PostDetailPage.tsx": "Detail page for a single blog post showing full content, images, and owner-only edit/delete controls with a confirmation dialog for deletion.",
  "frontend/src/utils/dateFormatter.ts": "Utility that converts a nanosecond-precision Time value to a Swedish locale date string.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color tokens, typography/container-queries/animate plugins, and extended theme settings for fonts, border radius, and shadows.",
  "project_state.json": "Project state metadata file tracking version, existing features, and architectural notes, specifically recording the hardcoded admin principal ID for the project."
}