{
  "backend/main.mo": "Main Motoko actor implementing a blog platform with post CRUD, user profiles, image storage via blob-storage mixin, and role-based access control with owner/admin management.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—debug principal ID display on HomePage and hardcoded ADMIN_PRINCIPAL_ID check in Layout.tsx—to their relevant files and test IDs.",
  "frontend-file-summaries.txt": "Catalogue of short summaries for all frontend source files, describing the purpose and key implementation details of each component, page, hook, and utility.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark color themes, including background, foreground, chart, and sidebar tokens.",
  "frontend/index.html": "HTML entry point with Swedish language attribute, HKLO page title, and a root div that mounts the React application via main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree with public login and protected routes (home, post detail, edit, create, admin), each wrapped in ProtectedRoute and Layout.",
  "frontend/src/components/admin/AllPostsSection.tsx": "Admin table view of all blog posts with controls to edit, delete, and change the status (published/draft/hidden) of each post.",
  "frontend/src/components/admin/ManageAdminsSection.tsx": "Admin panel section for listing, adding, and removing admin principals via Internet Identity, with error handling for unauthorized or invalid inputs.",
  "frontend/src/components/admin/ManageAuthorsSection.tsx": "Admin panel section that lists all authors and allows removing an author along with all their posts, with confirmation dialog.",
  "frontend/src/components/admin/PostEditModal.tsx": "Modal dialog for admins to edit a post's title, content, author, status, and images, supporting both existing image management and new image uploads.",
  "frontend/src/components/ImageGallery.tsx": "Displays an array of Uint8Array images in a responsive grid by converting each to a blob URL, with loading state and cleanup of object URLs on unmount.",
  "frontend/src/components/Layout.tsx": "App shell with sticky header, navigation links, and footer; gates the Admin Panel link using a frontend-only comparison of the logged-in user's principal against the hardcoded ADMIN_PRINCIPAL_ID constant.",
  "frontend/src/components/PostCard.tsx": "Renders a blog post card with thumbnail image, title, author, date, and a content preview, linking to the full post page.",
  "frontend/src/components/ProtectedRoute.tsx": "Wraps routes to require Internet Identity authentication, redirecting unauthenticated users to the login page while showing a loading state during initialization.",
  "frontend/src/config/constants.ts": "Exports a placeholder ADMIN_PRINCIPAL_ID constant that must be replaced with the actual Internet Identity principal ID.",
  "frontend/src/data/titleSuggestions.ts": "Defines a set of Swedish blog post title suggestions organized by category (Livsstil, Mat, Hobby, etc.) and exports the category list.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated identities, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useImageUpload.ts": "React hook for managing image uploads with client-side compression (max 1024px, JPEG 75% quality via Canvas API), validation, preview URLs, and conversion to Uint8Array for backend submission.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider for ICP, exposing login/logout functions, identity state, and login status via React context and AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including fetching/creating/updating/deleting posts, checking admin status, and managing admins and authors.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm editorial color palette with CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard page that checks caller admin status and renders tabbed sections for managing posts, admins, and authors, with loading and access-denied states.",
  "frontend/src/pages/CreatePostPage.tsx": "Page component with a form for creating new blog posts, supporting title suggestions by category, image uploads, publish toggle, and form validation before submitting via the createPost mutation.",
  "frontend/src/pages/EditPostPage.tsx": "Page component for editing an existing blog post, including form fields for title, content, author, category, publish status, and image management. Validates ownership via Internet Identity before allowing edits and submits updates via the useUpdatePost mutation.",
  "frontend/src/pages/HomePage.tsx": "Home page that fetches and displays all published posts sorted by creation date as a grid of PostCards. Also shows the authenticated user's Principal ID with a copy button for admin configuration purposes.",
  "frontend/src/pages/LoginPage.tsx": "Login page that provides Internet Identity authentication, redirecting already-authenticated users to the home page. Displays a login button and a link to create a new Internet Identity account.",
  "frontend/src/pages/PostDetailPage.tsx": "Detail view for a single blog post showing its content, metadata, and image gallery. Provides edit and delete controls to the post owner, with a confirmation dialog before deletion.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that converts a backend Time value (nanoseconds) to a human-readable Swedish locale date string.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode support, custom OKLCH-based color tokens, extended typography/serif font families, border radius variables, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks project state for the HKLO Blogg app, describing a fix request to make the Admin Panel nav link visible only to a hardcoded Internet Identity principal ID. Records existing features (debug principal display, frontend-only admin check) and a pending architectural request."
}