{
  "backend/main.mo": "Main Motoko actor for a blog platform implementing post CRUD, user profiles, image storage via blob-storage mixin, and role-based access control with owner/admin management.",
  "feature_evidence.json": "Feature evidence report mapping implemented feature IDs to their affected files, related components, test IDs, and confidence levels for image upload, UI feedback, and display improvements.",
  "frontend-file-summaries.txt": "JSON map of frontend source file paths to short human-readable summaries describing each file's purpose and key implementation details.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based design token CSS variables for light and dark modes, plus base body and border styles.",
  "frontend/index.html": "Minimal HTML shell with Swedish language attribute, HKLO title, and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "TanStack Router setup defining all application routes (home, post detail, create, edit, admin, login), wrapping protected routes in ProtectedRoute and Layout components.",
  "frontend/src/components/admin/AllPostsSection.tsx": "Admin section that lists all posts in a table with options to edit, delete, and change post status (published/draft/hidden) using mutation hooks and toast notifications.",
  "frontend/src/components/admin/ManageAdminsSection.tsx": "Admin section for managing admin principals, allowing the owner to add new admins by principal ID and remove existing ones via a confirmation dialog.",
  "frontend/src/components/admin/ManageAuthorsSection.tsx": "Admin section that lists all authors in a table and allows removing an author (along with all their posts) via a confirmation dialog.",
  "frontend/src/components/admin/PostEditModal.tsx": "A modal dialog component for editing an existing blog post, supporting title/content/author/status fields, existing image management, and new image uploads with validation.",
  "frontend/src/components/ImageGallery.tsx": "React component that converts Uint8Array images to blob URLs using a ref for reliable cleanup on unmount, renders them in a responsive grid, and shows an ImageOff placeholder for empty or malformed blobs.",
  "frontend/src/components/Layout.tsx": "Main app layout component with a sticky header (logo, navigation links, admin link, logout button) and footer. Uses Internet Identity to determine authentication and admin status.",
  "frontend/src/components/PostCard.tsx": "Card component that displays a blog post preview with thumbnail image (converted from binary blob), title, author, date, and a truncated content excerpt with a 'read more' link.",
  "frontend/src/components/ProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to the login page, showing a loading spinner while the Internet Identity session initializes.",
  "frontend/src/config/constants.ts": "Exports a single constant defining the admin principal ID for access control.",
  "frontend/src/data/titleSuggestions.ts": "Defines blog post category types and a record of Swedish title suggestions grouped by category.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useImageUpload.ts": "A React hook that handles image file selection, validation, compression/resizing via Canvas, and conversion to Uint8Array blobs for upload.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including fetching, creating, updating, and deleting posts, as well as admin-specific queries.",
  "frontend/src/index.css": "Global CSS file that sets up Tailwind directives and defines a warm editorial color palette with CSS custom properties for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AdminPage.tsx": "Admin panel page that checks if the current user is an admin and renders tabbed sections for managing posts, admins, and authors. Shows access-denied UI for non-admins and a loading spinner while checking permissions.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page for creating a new blog post with fields for title, content, author, category, publish toggle, and image uploads, including validation and error handling.",
  "frontend/src/pages/EditPostPage.tsx": "Form page for editing an existing post, pre-populated with current post data; verifies ownership via Internet Identity and supports updating text fields, publish status, and images (existing + new).",
  "frontend/src/pages/HomePage.tsx": "Home page that fetches and displays all published posts sorted by creation date as a grid of PostCard components, with loading and error states.",
  "frontend/src/pages/LoginPage.tsx": "Login page that authenticates users via Internet Identity, redirects already-authenticated users to home, and provides a link to create a new Internet Identity.",
  "frontend/src/pages/PostDetailPage.tsx": "Detail page for a single post showing its content, images, and metadata; allows the post owner to edit or delete the post with a confirmation dialog.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that converts a nanosecond-precision IC Time value to a human-readable Swedish locale date string.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH color tokens, extended typography/container/animation plugins, and design system variables for a component library.",
  "project_state.json": "Project state tracking file describing a blog/CMS on the Internet Computer with admin panel and image upload features, listing existing features, known issues, and new feature requests."
}