{
  "backend/main.mo": "Main Motoko actor implementing a blog backend with CRUD operations for posts (create, read, update, delete), owner-based authorization, image storage via blob-storage mixin, and published/unpublished post filtering.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a Swedish-language blog application with Internet Identity authentication, post management, image uploads, and editorial design.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color variables for light and dark modes, defining editorial color palette and design tokens for the application.",
  "frontend/index.html": "HTML entry point with Swedish language attribute, HKLO title, and root div mounting the React application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining public login route and protected routes (home, post detail, edit, create) wrapped with ProtectedRoute and Layout components.",
  "frontend/src/components/ImageGallery.tsx": "Component that converts Uint8Array images to blob URLs and displays them in a responsive grid with loading states and automatic cleanup.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with HKLO branding header, Swedish navigation (Hem, Skapa inlägg, Logga ut), logout functionality, and footer with caffeine.ai attribution.",
  "frontend/src/components/PostCard.tsx": "Reusable blog post card component displaying title, author, date, content preview, and optional thumbnail image with Swedish \"Läs mer\" link.",
  "frontend/src/components/ProtectedRoute.tsx": "Authentication wrapper that redirects unauthenticated users to login, shows loading spinner during initialization, and renders children only for authenticated users.",
  "frontend/src/data/titleSuggestions.ts": "TypeScript data file containing predefined Swedish blog title suggestions organized by five categories (Livsstil, Livsberättelser, Mat, Hobby, Djupa tankar).",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useImageUpload.ts": "Provides image upload functionality with validation (file type, 10MB limit), preview generation, progress tracking, and conversion to Uint8Array blobs for backend submission.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on posts (get all published, get by ID, create, update, delete) with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm editorial color palette for light and dark modes, including typography enhancements for serif headings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page for creating new blog posts with title suggestions by category, image upload support, validation, and publish/draft toggle functionality.",
  "frontend/src/pages/EditPostPage.tsx": "Form page for editing existing posts with ownership verification, pre-populated fields, existing image management, and new image upload capabilities.",
  "frontend/src/pages/HomePage.tsx": "Displays a grid of published blog posts sorted by creation date with loading and error states.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that uses Internet Identity for authentication, displays a welcome card with login button, and redirects authenticated users to home page.",
  "frontend/src/pages/PostDetailPage.tsx": "Post detail page component that displays a single blog post with full content, includes edit/delete functionality for post owners, and uses ImageGallery for media display.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that converts Time type from backend to formatted Swedish locale date string.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, typography plugin, container queries, and custom animations for UI components.",
  "project_state.json": "Project state tracking document listing implemented features including blog post CRUD operations, Swedish localization, Internet Identity authentication, and editorial design system."
}