{
  "backend/main.mo": "Main Motoko actor implementing a blog backend with CRUD operations for posts (create, read, update, delete), blob storage mixin for image handling, and in-memory Map storage for posts with auto-incrementing IDs.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: a category dropdown ('Kategori') with five predefined Swedish categories and a secondary suggested title dropdown ('Föreslagen titel') that populates based on selected category.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing the React application structure with TanStack Router, Swedish localization, Internet Identity authentication, image upload/display functionality, and category/title suggestion features.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color palette for light and dark modes, CSS custom properties for design tokens, and base styling for the editorial blog theme.",
  "frontend/index.html": "HTML entry point with Swedish language attribute (lang='sv'), HKLO title, and root div mounting point for the React application.",
  "frontend/src/App.tsx": "TanStack Router configuration defining root route with Outlet, public login route, and three protected routes (home, post detail, create) each wrapped with ProtectedRoute and Layout components.",
  "frontend/src/components/ImageGallery.tsx": "Reusable component that converts Uint8Array images to blob URLs and displays them in a responsive grid layout (1-3 columns) with loading states and automatic cleanup.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header containing HKLO branding and Swedish navigation (Hem, Skapa inlägg, Logga ut), logout functionality via Internet Identity hook, and footer with caffeine.ai attribution.",
  "frontend/src/components/PostCard.tsx": "Blog post card component displaying title, author, date, content preview, and optional thumbnail image (first image from post.images array) with Swedish 'Läs mer' link and hover effects.",
  "frontend/src/components/ProtectedRoute.tsx": "Authentication wrapper component that shows loading spinner during initialization, redirects unauthenticated users to /login, and renders children only for authenticated Internet Identity users.",
  "frontend/src/data/titleSuggestions.ts": "Defines blog post categories (Livsstil, Livsberättelser, Mat, Hobby, Djupa tankar) and provides Swedish title suggestions for each category.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages a backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useImageUpload.ts": "React hook for managing image uploads with validation (type, 10MB limit), preview generation, progress tracking, and conversion to Uint8Array blobs.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for fetching published posts, individual posts by ID, and creating new posts with optional images using the backend actor.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom warm editorial color palette for light and dark modes, plus typography enhancements for serif headings.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/CreatePostPage.tsx": "Form page for creating blog posts with title suggestions by category, content editor, author field, publish toggle, and multi-image upload with validation.",
  "frontend/src/pages/HomePage.tsx": "Landing page that displays all published blog posts sorted by creation date in a grid layout with loading and error states.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that uses Internet Identity for authentication, displays a welcome card with login button, and redirects authenticated users to home.",
  "frontend/src/pages/PostDetailPage.tsx": "Post detail page that fetches and displays a single blog post with title, author, date, content, and optional image gallery, with navigation back to home.",
  "frontend/src/utils/dateFormatter.ts": "Utility function that converts Time type (nanoseconds) to Swedish-formatted date string (year, month, day).",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, typography plugin, container queries, animations, and extended font families.",
  "project_state.json": "Project state tracking document listing implemented features including blog post display, creation form, Swedish translation, Internet Identity authentication, and editorial design."
}