{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add topic selection dropdown with predefined Swedish blog titles",
  "requirements": [
    {
      "id": "REQ-31",
      "summary": "Add 'Kategori' dropdown with five predefined Swedish topic categories to create post form",
      "acceptanceCriteria": [
        "A dropdown/listbox control appears in the create post form",
        "The dropdown is labeled 'Kategori' in Swedish",
        "The dropdown contains exactly five options: Livsstil, Livsberättelser, Mat, Hobby, Djupa tankar",
        "The dropdown is positioned before the title input field",
        "Users can select one category from the dropdown"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreatePostPage.tsx",
          "operation": "modify",
          "description": "Add a new category dropdown field labeled 'Kategori' positioned before the existing title input. Implement state management for the selected category using React useState. Add a Select component from shadcn/ui (components/ui) with the five predefined Swedish categories: 'Livsstil', 'Livsberättelser', 'Mat', 'Hobby', 'Djupa tankar'. The dropdown should be optional and not required for form submission. Preserve existing form validation logic and Swedish UI text conventions."
        }
      ]
    },
    {
      "id": "REQ-32",
      "summary": "Add conditional 'Föreslagen titel' dropdown that shows category-specific predefined Swedish title suggestions",
      "acceptanceCriteria": [
        "A second dropdown appears after the user selects a category",
        "The second dropdown is labeled 'Föreslagen titel'",
        "The second dropdown contains the exact predefined titles for the selected category",
        "Selecting 'Livsstil' shows 5 lifestyle-related titles",
        "Selecting 'Livsberättelser' shows 5 life story titles",
        "Selecting 'Mat' shows 6 food-related titles",
        "Selecting 'Hobby' shows 4 hobby-related titles",
        "Selecting 'Djupa tankar' shows 5 philosophical titles",
        "The dropdown remains empty or hidden until a category is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/titleSuggestions.ts",
          "operation": "create",
          "description": "Create a new TypeScript data file containing the predefined Swedish title suggestions organized by category. Define a type for the category keys ('Livsstil' | 'Livsberättelser' | 'Mat' | 'Hobby' | 'Djupa tankar') and export a mapping object with all titles: Livsstil (5 titles: 'Minimalism som livsstil: Hur jag förenklade mitt liv och hittade lyckan', 'Hållbarhet i vardagen: Små steg som gör stor skillnad', 'Att leva med avsikt: Så skapar du en meningsfull vardag', 'Digital detox: Hur jag lärde mig att koppla av från skärmarna', 'Livsstilsförändringar som faktiskt fungerar – min resa'), Livsberättelser (5 titles: 'Från kaos till klarhet: Min resa att hitta mig själv', 'Att börja om: Hur jag byggde upp mitt liv efter en stor förlust', 'De misstag som formade mig – och varför jag inte ångrar dem', 'Att växa upp som introvert i en extrovert värld', 'Brevet jag önskar jag hade skrivit till mitt yngre jag'), Mat (6 titles: 'Enkla, näringsrika måltider för en hektisk vardag', 'Vegetarisk mat som även köttätare älskar', 'Mitt hemliga recept: Den perfekta sourdough-brödguiden', 'Matlagning på budget – goda rätter som inte kostar skjortan', 'Smaker från världen: Mina favoritrecept efter resor i Asien', 'Hjärte mat'), Hobby (4 titles: 'Att hitta glädje i hantverk: Min resa med stickning och virkning', 'Trädgårdsdrömmar: Så skapade jag mitt eget urbana paradis', 'Fotografi för nybörjare – mina bästa tips och tricks', 'DIY-projekt som förvandlade mitt hem'), and Djupa tankar (5 titles: 'Att hitta mening i en kaotisk värld', 'Varför vi behöver tystnad i en högljudd tid', 'Att släppa taget: Konsten att acceptera det man inte kan kontrollera', 'Vad lycka egentligen betyder – och hur jag hittade min', 'Att leva i nuet: Lektioner från mindfulness och meditation')."
        },
        {
          "path": "frontend/src/pages/CreatePostPage.tsx",
          "operation": "modify",
          "description": "Import the title suggestions data from frontend/src/data/titleSuggestions.ts. Add a second dropdown field labeled 'Föreslagen titel' positioned after the category dropdown and before the title input field. Implement conditional rendering logic to show this dropdown only when a category has been selected. Use the selected category to filter and display the corresponding predefined Swedish titles. Add state management for the suggested title selection. The dropdown should be optional and use shadcn/ui Select component (components/ui) for consistency."
        }
      ]
    },
    {
      "id": "REQ-33",
      "summary": "Auto-populate title input field when user selects a suggested title, allowing further editing",
      "acceptanceCriteria": [
        "Selecting a suggested title populates the 'Titel' input field",
        "The populated title text is editable by the user",
        "Users can still manually type a custom title without selecting from suggestions",
        "The title field updates immediately when a suggestion is selected"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreatePostPage.tsx",
          "operation": "modify",
          "description": "Add an onChange handler to the 'Föreslagen titel' dropdown that updates the existing title input field state when a suggestion is selected. Ensure the title input remains fully editable after being populated. The implementation should allow users to modify the auto-populated title or clear it and type their own. No changes to existing title field validation or submission logic."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Ensure category and suggested title dropdowns are optional fields in the form",
      "acceptanceCriteria": [
        "Users can create a post without selecting a category or suggested title",
        "The category and title suggestion fields are not required for form submission",
        "Users can freely type in the 'Titel' field without interacting with the dropdowns"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreatePostPage.tsx",
          "operation": "modify",
          "description": "Verify that the category and suggested title dropdown fields do not have required validation. Ensure the existing form submission logic allows posts to be created with only title, content, and author fields populated (matching current backend requirements). The dropdowns should be enhancement features that do not block users from manually entering custom titles."
        }
      ]
    }
  ]
}